% Adc=2;%直流分量幅度
% A1=3;%频率F1信号的幅度
% A2=1.5; %频率F2信号的幅度
% F1=50;%信号1频率(Hz)
% F2=75;%信号2频率(Hz)
% Fs=256; %采样频率(Hz)
% P1=-30; %信号1相位(度)
% P2=90;%信号相位(度)
% N=256;%采样点数
% t=[0:1/Fs:N/Fs]; %采样时刻
%信号
% S=Adc+A1*cos(2*pi*F1*t+pi*P1/180)+A2*cos(2*pi*F2*t+pi*P2/180);
[S,T_sigal]=loadeceieast1(042987,12, 8, [0 10],1e6,1,'F:\ProgramProject\ECEI-loaddata\');
%显示原始信号
plot(S);
title('原始信号');
figure;
Y = fft(S); %做FFT变换
Ayy = (abs(Y)); %取模
plot(Ayy(1:1000000)); %显示原始的FFT模值结果

% title('FFT 模值');
% figure;
% Ayy=Ayy/(N/2);%换算成实际的幅度
% Ayy(1)=Ayy(1)/2; %直流量不同与其他
% F=([1:N]-1)*Fs/N; %换算成实际的频率值 ,等同于F=(0:N)*Fs/N;
% plot(F(1:N/2),Ayy(1:N/2));%显示换算后的FFT模值结果
% title('幅度-频率曲线图');
%采样点数要不小于采样频率，否则会出错（自己写的）
% fs=5120;%采样频率为1000Hz;
% N=1024;
% t=0:1/fs:N/fs;
% x=3*cos(2*pi*53*t);%产生正弦波信号；
% subplot(2,1,1)
% plot(t(1:50),x(1:50));%画出时域内的信号前50个采样点；
% Y=fft(x,N); %对X进行512点的傅立叶变换；
% Y1=abs(Y);
% Y2=Y1/(N/2);%换算成实际的幅度
% f= (0:N)*fs/N;%设置频率轴（横轴）坐标，1000为采样频率；fs/N是每个采%样点对应的频率，*(0:N)为了让频率从0开始表示。
% subplot(2,1,2)
% plot(f(1:257),Y2(1:257));%画出频域内的信号